espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_gpio_port.h
#define _GPIO_P_MODEH_MODE3_WIREDANDALT                0x0000000CUL                                        /**< Mode WIREDANDALT for GPIO_P_MODEH           */
#define _GPIO_P_MODEH_MODE3_WIREDANDALTFILTER          0x0000000DUL                                        /**< Mode WIREDANDALTFILTER for GPIO_P_MODEH     */
#define _GPIO_P_MODEH_MODE3_WIREDANDALTPULLUP          0x0000000EUL                                        /**< Mode WIREDANDALTPULLUP for GPIO_P_MODEH     */
#define _GPIO_P_MODEH_MODE3_WIREDANDALTPULLUPFILTER    0x0000000FUL                                        /**< Mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE3_DEFAULT                     (_GPIO_P_MODEH_MODE3_DEFAULT << 12)                 /**< Shifted mode DEFAULT for GPIO_P_MODEH       */
#define GPIO_P_MODEH_MODE3_DISABLED                    (_GPIO_P_MODEH_MODE3_DISABLED << 12)                /**< Shifted mode DISABLED for GPIO_P_MODEH      */
#define GPIO_P_MODEH_MODE3_INPUT                       (_GPIO_P_MODEH_MODE3_INPUT << 12)                   /**< Shifted mode INPUT for GPIO_P_MODEH         */
#define GPIO_P_MODEH_MODE3_INPUTPULL                   (_GPIO_P_MODEH_MODE3_INPUTPULL << 12)               /**< Shifted mode INPUTPULL for GPIO_P_MODEH     */
#define GPIO_P_MODEH_MODE3_INPUTPULLFILTER             (_GPIO_P_MODEH_MODE3_INPUTPULLFILTER << 12)         /**< Shifted mode INPUTPULLFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE3_PUSHPULL                    (_GPIO_P_MODEH_MODE3_PUSHPULL << 12)                /**< Shifted mode PUSHPULL for GPIO_P_MODEH      */
#define GPIO_P_MODEH_MODE3_PUSHPULLALT                 (_GPIO_P_MODEH_MODE3_PUSHPULLALT << 12)             /**< Shifted mode PUSHPULLALT for GPIO_P_MODEH   */
#define GPIO_P_MODEH_MODE3_WIREDOR                     (_GPIO_P_MODEH_MODE3_WIREDOR << 12)                 /**< Shifted mode WIREDOR for GPIO_P_MODEH       */
#define GPIO_P_MODEH_MODE3_WIREDORPULLDOWN             (_GPIO_P_MODEH_MODE3_WIREDORPULLDOWN << 12)         /**< Shifted mode WIREDORPULLDOWN for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE3_WIREDAND                    (_GPIO_P_MODEH_MODE3_WIREDAND << 12)                /**< Shifted mode WIREDAND for GPIO_P_MODEH      */
#define GPIO_P_MODEH_MODE3_WIREDANDFILTER              (_GPIO_P_MODEH_MODE3_WIREDANDFILTER << 12)          /**< Shifted mode WIREDANDFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE3_WIREDANDPULLUP              (_GPIO_P_MODEH_MODE3_WIREDANDPULLUP << 12)          /**< Shifted mode WIREDANDPULLUP for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE3_WIREDANDPULLUPFILTER        (_GPIO_P_MODEH_MODE3_WIREDANDPULLUPFILTER << 12)    /**< Shifted mode WIREDANDPULLUPFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE3_WIREDANDALT                 (_GPIO_P_MODEH_MODE3_WIREDANDALT << 12)             /**< Shifted mode WIREDANDALT for GPIO_P_MODEH   */
#define GPIO_P_MODEH_MODE3_WIREDANDALTFILTER           (_GPIO_P_MODEH_MODE3_WIREDANDALTFILTER << 12)       /**< Shifted mode WIREDANDALTFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE3_WIREDANDALTPULLUP           (_GPIO_P_MODEH_MODE3_WIREDANDALTPULLUP << 12)       /**< Shifted mode WIREDANDALTPULLUP for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE3_WIREDANDALTPULLUPFILTER     (_GPIO_P_MODEH_MODE3_WIREDANDALTPULLUPFILTER << 12) /**< Shifted mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEH*/

/* Bit fields for GPIO_P DOUT */
#define _GPIO_P_DOUT_RESETVALUE                        0x00000000UL                     /**< Default value for GPIO_P_DOUT               */
#define _GPIO_P_DOUT_MASK                              0x00000FFFUL                     /**< Mask for GPIO_P_DOUT                        */
#define _GPIO_P_DOUT_DOUT_SHIFT                        0                                /**< Shift value for GPIO_DOUT                   */
#define _GPIO_P_DOUT_DOUT_MASK                         0xFFFUL                          /**< Bit mask for GPIO_DOUT                      */
#define _GPIO_P_DOUT_DOUT_DEFAULT                      0x00000000UL                     /**< Mode DEFAULT for GPIO_P_DOUT                */
#define GPIO_P_DOUT_DOUT_DEFAULT                       (_GPIO_P_DOUT_DOUT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_P_DOUT        */

/* Bit fields for GPIO_P DIN */
#define _GPIO_P_DIN_RESETVALUE                         0x00000000UL                     /**< Default value for GPIO_P_DIN                */
#define _GPIO_P_DIN_MASK                               0x00000FFFUL                     /**< Mask for GPIO_P_DIN                         */
#define _GPIO_P_DIN_DIN_SHIFT                          0                                /**< Shift value for GPIO_DIN                    */
#define _GPIO_P_DIN_DIN_MASK                           0xFFFUL                          /**< Bit mask for GPIO_DIN                       */
#define _GPIO_P_DIN_DIN_DEFAULT                        0x00000000UL                     /**< Mode DEFAULT for GPIO_P_DIN                 */
#define GPIO_P_DIN_DIN_DEFAULT                         (_GPIO_P_DIN_DIN_DEFAULT << 0)   /**< Shifted mode DEFAULT for GPIO_P_DIN         */
/** @} End of group Parts */

#endif /* GPIO_PORT_H */
